#### 引入

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

#### 创建对象

In [5]:
s = pd.Series([1,2,3,np.nan,5,6])

In [6]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

In [7]:
dates = pd.date_range('20180521', periods=6)

In [8]:
dates

DatetimeIndex(['2018-05-21', '2018-05-22', '2018-05-23', '2018-05-24',
               '2018-05-25', '2018-05-26'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [10]:
df

                   A         B         C         D
2018-05-21  0.926119 -1.924756 -0.174793  0.080794
2018-05-22 -0.565910  0.645812 -0.702561 -0.808264
2018-05-23 -0.741358  0.972067  1.084844  0.527297
2018-05-24 -0.078655 -0.153897 -1.570272 -1.116238
2018-05-25 -0.833807  2.870439  0.482071  1.667916
2018-05-26 -0.127380 -0.426989  1.316540 -0.295372

In [35]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20180521'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(['test', 'train', 'text', 'train']),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2018-05-21  1.0  3   test  foo
1  1.0 2018-05-21  1.0  3  train  foo
2  1.0 2018-05-21  1.0  3   text  foo
3  1.0 2018-05-21  1.0  3  train  foo

#### 查看数据

In [39]:
df.head(6)

                   A         B         C         D
2018-05-21  0.926119 -1.924756 -0.174793  0.080794
2018-05-22 -0.565910  0.645812 -0.702561 -0.808264
2018-05-23 -0.741358  0.972067  1.084844  0.527297
2018-05-24 -0.078655 -0.153897 -1.570272 -1.116238
2018-05-25 -0.833807  2.870439  0.482071  1.667916
2018-05-26 -0.127380 -0.426989  1.316540 -0.295372

In [38]:
df.tail(2)

                   A         B         C         D
2018-05-25 -0.833807  2.870439  0.482071  1.667916
2018-05-26 -0.127380 -0.426989  1.316540 -0.295372

In [41]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [42]:
df.index

DatetimeIndex(['2018-05-21', '2018-05-22', '2018-05-23', '2018-05-24',
               '2018-05-25', '2018-05-26'],
              dtype='datetime64[ns]', freq='D')

In [43]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [44]:
df.values

array([[ 0.92611891, -1.92475553, -0.17479299,  0.08079359],
       [-0.56590964,  0.64581249, -0.70256068, -0.80826356],
       [-0.74135782,  0.97206676,  1.08484394,  0.52729737],
       [-0.07865514, -0.15389684, -1.57027247, -1.11623763],
       [-0.83380675,  2.87043918,  0.48207147,  1.66791617],
       [-0.12737953, -0.42698893,  1.31654007, -0.2953719 ]])

In [45]:
df2.values

array([[1.0, Timestamp('2018-05-21 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2018-05-21 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2018-05-21 00:00:00'), 1.0, 3, 'text', 'foo'],
       [1.0, Timestamp('2018-05-21 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [46]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.236832  0.330446  0.072638  0.009356
std    0.649411  1.603554  1.104608  1.005237
min   -0.833807 -1.924756 -1.570272 -1.116238
25%   -0.697496 -0.358716 -0.570619 -0.680041
50%   -0.346645  0.245958  0.153639 -0.107289
75%   -0.090836  0.890503  0.934151  0.415671
max    0.926119  2.870439  1.316540  1.667916

In [47]:
df.T

   2018-05-21  2018-05-22  2018-05-23  2018-05-24  2018-05-25  2018-05-26
A    0.926119   -0.565910   -0.741358   -0.078655   -0.833807   -0.127380
B   -1.924756    0.645812    0.972067   -0.153897    2.870439   -0.426989
C   -0.174793   -0.702561    1.084844   -1.570272    0.482071    1.316540
D    0.080794   -0.808264    0.527297   -1.116238    1.667916   -0.295372

In [49]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2018-05-21  0.926119 -1.924756 -0.174793  0.080794
2018-05-22 -0.565910  0.645812 -0.702561 -0.808264
2018-05-23 -0.741358  0.972067  1.084844  0.527297
2018-05-24 -0.078655 -0.153897 -1.570272 -1.116238
2018-05-25 -0.833807  2.870439  0.482071  1.667916
2018-05-26 -0.127380 -0.426989  1.316540 -0.295372

In [52]:
df.sort_values(by='A', ascending=False)

                   A         B         C         D
2018-05-21  0.926119 -1.924756 -0.174793  0.080794
2018-05-24 -0.078655 -0.153897 -1.570272 -1.116238
2018-05-26 -0.127380 -0.426989  1.316540 -0.295372
2018-05-22 -0.565910  0.645812 -0.702561 -0.808264
2018-05-23 -0.741358  0.972067  1.084844  0.527297
2018-05-25 -0.833807  2.870439  0.482071  1.667916

#### 选择

In [55]:
df['A']

2018-05-21    0.926119
2018-05-22   -0.565910
2018-05-23   -0.741358
2018-05-24   -0.078655
2018-05-25   -0.833807
2018-05-26   -0.127380
Freq: D, Name: A, dtype: float64

In [56]:
df[0:2]

                   A         B         C         D
2018-05-21  0.926119 -1.924756 -0.174793  0.080794
2018-05-22 -0.565910  0.645812 -0.702561 -0.808264

In [57]:
df['20180521':'20180523']

                   A         B         C         D
2018-05-21  0.926119 -1.924756 -0.174793  0.080794
2018-05-22 -0.565910  0.645812 -0.702561 -0.808264
2018-05-23 -0.741358  0.972067  1.084844  0.527297

In [60]:
df.loc[dates[0]]

A    0.926119
B   -1.924756
C   -0.174793
D    0.080794
Name: 2018-05-21 00:00:00, dtype: float64

In [64]:
df.loc[dates[0]:dates[2], ['A', 'B']]

                   A         B
2018-05-21  0.926119 -1.924756
2018-05-22 -0.565910  0.645812
2018-05-23 -0.741358  0.972067

In [66]:
df.at[dates[1], 'A']

-0.5659096374708477

In [67]:
df

                   A         B         C         D
2018-05-21  0.926119 -1.924756 -0.174793  0.080794
2018-05-22 -0.565910  0.645812 -0.702561 -0.808264
2018-05-23 -0.741358  0.972067  1.084844  0.527297
2018-05-24 -0.078655 -0.153897 -1.570272 -1.116238
2018-05-25 -0.833807  2.870439  0.482071  1.667916
2018-05-26 -0.127380 -0.426989  1.316540 -0.295372

In [69]:
df.iloc[1]

A   -0.565910
B    0.645812
C   -0.702561
D   -0.808264
Name: 2018-05-22 00:00:00, dtype: float64

In [73]:
df.iloc[1:3, 0:2]

                   A         B
2018-05-22 -0.565910  0.645812
2018-05-23 -0.741358  0.972067